nova/DATA/DATA/sw/fio_output_1G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 1024MiB) test: (groupid=0, jobs=1): err= 0: pid=3170165: Mon Oct 14 19:38:21 2024 write: IOPS=233k, BW=909MiB/s (954MB/s)(1024MiB/1126msec); 0 zone resets clat (usec): min=2, max=1679, avg= 4.10, stdev= 8.36 lat (usec): min=2, max=1679, avg= 4.13, stdev= 8.36 clat percentiles (nsec): | 1.00th=[ 3024], 5.00th=[ 3152], 10.00th=[ 3248], 20.00th=[ 3376], | 30.00th=[ 3472], 40.00th=[ 3568], 50.00th=[ 3696], 60.00th=[ 3856], | 70.00th=[ 4128], 80.00th=[ 4896], 90.00th=[ 5216], 95.00th=[ 5408], | 99.00th=[ 6624], 99.50th=[ 6944], 99.90th=[19584], 99.95th=[20352], | 99.99th=[22912] bw ( KiB/s): min=930144, max=934192, per=100.00%, avg=932168.00, stdev=2862.37, samples=2 iops : min=232536, max=233548, avg=233042.00, stdev=715.59, samples=2 lat (usec) : 4=66.74%, 10=32.94%, 20=0.25%, 50=0.06%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01% cpu : usr=6.67%, sys=93.16%, ctx=2, majf=0, minf=15 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=909MiB/s (954MB/s), 909MiB/s-909MiB/s (954MB/s-954MB/s), io=1024MiB (1074MB), run=1126-1126msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%