nova/DATA/DATA/sw/fio_output_32G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 32768MiB) test: (groupid=0, jobs=1): err= 0: pid=3180276: Mon Oct 14 19:40:04 2024 write: IOPS=164k, BW=642MiB/s (673MB/s)(32.0GiB/51028msec); 0 zone resets clat (usec): min=2, max=57033, avg= 5.91, stdev=257.59 lat (usec): min=2, max=57033, avg= 5.94, stdev=257.59 clat percentiles (nsec): | 1.00th=[ 2928], 5.00th=[ 3088], 10.00th=[ 3184], 20.00th=[ 3344], | 30.00th=[ 3472], 40.00th=[ 3600], 50.00th=[ 3760], 60.00th=[ 3952], | 70.00th=[ 4576], 80.00th=[ 5024], 90.00th=[ 5408], 95.00th=[ 6112], | 99.00th=[ 7712], 99.50th=[ 8256], 99.90th=[19584], 99.95th=[20864], | 99.99th=[23424] bw ( KiB/s): min=487240, max=1022592, per=100.00%, avg=657886.43, stdev=134325.60, samples=102 iops : min=121810, max=255648, avg=164471.61, stdev=33581.39, samples=102 lat (usec) : 4=61.32%, 10=38.38%, 20=0.23%, 50=0.07%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01% lat (msec) : 100=0.01% cpu : usr=4.61%, sys=95.33%, ctx=72, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=642MiB/s (673MB/s), 642MiB/s-642MiB/s (673MB/s-673MB/s), io=32.0GiB (34.4GB), run=51028-51028msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%