nova/DATA/DATA/sw/fio_output_64G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 65536MiB) test: (groupid=0, jobs=1): err= 0: pid=3182648: Mon Oct 14 19:42:22 2024 write: IOPS=125k, BW=487MiB/s (511MB/s)(64.0GiB/134603msec); 0 zone resets clat (usec): min=2, max=115010, avg= 7.83, stdev=519.36 lat (usec): min=2, max=115010, avg= 7.86, stdev=519.36 clat percentiles (nsec): | 1.00th=[ 3024], 5.00th=[ 3184], 10.00th=[ 3312], 20.00th=[ 3472], | 30.00th=[ 3600], 40.00th=[ 3728], 50.00th=[ 3888], 60.00th=[ 4128], | 70.00th=[ 4896], 80.00th=[ 5216], 90.00th=[ 5472], 95.00th=[ 5920], | 99.00th=[ 7072], 99.50th=[ 7840], 99.90th=[19840], 99.95th=[21120], | 99.99th=[23424] bw ( KiB/s): min=287312, max=938640, per=100.00%, avg=498828.73, stdev=139504.28, samples=269 iops : min=71828, max=234662, avg=124707.19, stdev=34876.12, samples=269 lat (usec) : 4=56.07%, 10=43.60%, 20=0.24%, 50=0.08%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01% lat (msec) : 100=0.01%, 250=0.01% cpu : usr=3.23%, sys=96.67%, ctx=207, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=487MiB/s (511MB/s), 487MiB/s-487MiB/s (511MB/s-511MB/s), io=64.0GiB (68.7GB), run=134603-134603msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%