nova/DATA/DATA/sw/fio_output_8G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 8192MiB) test: (groupid=0, jobs=1): err= 0: pid=3174633: Mon Oct 14 19:38:45 2024 write: IOPS=216k, BW=844MiB/s (885MB/s)(8192MiB/9702msec); 0 zone resets clat (usec): min=2, max=13323, avg= 4.45, stdev=61.80 lat (usec): min=2, max=13323, avg= 4.48, stdev=61.80 clat percentiles (nsec): | 1.00th=[ 2928], 5.00th=[ 3088], 10.00th=[ 3184], 20.00th=[ 3344], | 30.00th=[ 3440], 40.00th=[ 3536], 50.00th=[ 3664], 60.00th=[ 3824], | 70.00th=[ 4192], 80.00th=[ 4896], 90.00th=[ 5216], 95.00th=[ 5472], | 99.00th=[ 6688], 99.50th=[ 7456], 99.90th=[19584], 99.95th=[20352], | 99.99th=[22912] bw ( KiB/s): min=771952, max=950048, per=100.00%, avg=867017.68, stdev=56641.88, samples=19 iops : min=192988, max=237514, avg=216754.53, stdev=14160.63, samples=19 lat (usec) : 4=66.61%, 10=33.10%, 20=0.23%, 50=0.06%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01% cpu : usr=5.93%, sys=94.06%, ctx=12, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,2097152,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=844MiB/s (885MB/s), 844MiB/s-844MiB/s (885MB/s-885MB/s), io=8192MiB (8590MB), run=9702-9702msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%